ConfigurationFonecmidDiplomTuzeka/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ПродажиУслуг</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт

	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;

КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВКМ_Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ВКМ_Акт");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ВКМ_ПечатьАкта(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ВКМ_Акт";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ПечатьАкта(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ВКМ_ПараметрыПечати_Акт";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_Акт");

	ДанныеДокументов = ВКМ_ПолучитьДанныеАктов(МассивОбъектов);

	ПервыйДокумент = Истина;

	Пока ДанныеДокументов.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.НомерИДата = "№ " + ДанныеДокументов.Номер + " от " + Формат(ДанныеДокументов.Дата, "ДФ=дд.ММ.гггг");
		ОбластьЗаголовок.Параметры.СтрокаИсполнитель = "Исполнитель: " + ДанныеДокументов.Организация;
		ОбластьЗаголовок.Параметры.СтрокаЗаказчик = "Заказчик: " + ДанныеДокументов.Контрагент;
		ОбластьЗаголовок.Параметры.СтрокаДоговор = "Договор: " + ДанныеДокументов.Договор;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));

		ИтогоСумма = 0;
		НомерСтрокиТаблицы = 0;

		ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			НомерСтрокиТаблицы = НомерСтрокиТаблицы + 1;
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтрокиТаблицы;
			ОбластьСтрока.Параметры.Номенклатура = ВыборкаТовары.Номенклатура;
			ОбластьСтрока.Параметры.Количество = ВыборкаТовары.Количество;
			ОбластьСтрока.Параметры.Цена = ВыборкаТовары.Цена;
			ОбластьСтрока.Параметры.Сумма = ВыборкаТовары.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			ИтогоСумма = ИтогоСумма + ВыборкаТовары.Сумма;
		КонецЦикла;

		ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			НомерСтрокиТаблицы = НомерСтрокиТаблицы + 1;
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтрокиТаблицы;
			ОбластьСтрока.Параметры.Номенклатура = ВыборкаУслуги.Номенклатура;
			ОбластьСтрока.Параметры.Количество = ВыборкаУслуги.Количество;
			ОбластьСтрока.Параметры.Цена = ВыборкаУслуги.Цена;
			ОбластьСтрока.Параметры.Сумма = ВыборкаУслуги.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			ИтогоСумма = ИтогоСумма + ВыборкаУслуги.Сумма;
		КонецЦикла;

		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		ОбластьИтого.Параметры.ИтогоСумма = ИтогоСумма;
		ОбластьИтого.Параметры.СуммаПрописью = ВКМ_СуммаПрописью(ИтогоСумма);
		ТабличныйДокумент.Вывести(ОбластьИтого);

		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Подвал"));

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ВКМ_ПолучитьДанныеАктов(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ВКМ_СуммаПрописью(Сумма)

	ЦелыеРубли = Цел(Сумма);
	Копейки = Окр((Сумма - ЦелыеРубли) * 100, 0);

	Возврат ЧислоПрописью(ЦелыеРубли) + " руб. " + Формат(Копейки, "ЧН=00") + " коп.";

КонецФункции

#КонецОбласти

#КонецЕсли
